---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.InvalidExteriorWallTypeConstruction
enum: Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType
source: html/f02d8d2d-735a-30d3-2a94-5ca37d8c05d0.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.InvalidExteriorWallTypeConstruction

Invalid value/not set Roof Type Construction value